import image from "../assets/images/controller.png";
import {categories} from "./categories";

export const products = [
    {
        id: 1,
        image: image,
        name: "نام آیتم در دسته بندی",
        price: 22_000_000,
        categoryId: 1,
        description: "  توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح  توضیح توضیح"
        //onClick: () => {},
    },
    {
        id: 2,
        image: image,
        name: "نام آیتم در دسته بندی",
        price: 22_000_000,
        categoryId: 1,
        description: "  توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح  توضیح توضیح"
        //onClick: () => {},
    },
    {
        id: 3,
        image: image,
        name: "نام آیتم در دسته بندی",
        price: 22_000_000,
        categoryId: 1,
        description: "  توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح  توضیح توضیح"
        //onClick: () => {},
    },
    {
        id: 4,
        image: image,
        name: "نام آیتم در دسته بندی",
        price: 22_000_000,
        categoryId: 1,
        description: "  توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح  توضیح توضیح"
        //onClick: () => {},
    },
    {
        id: 5,
        image: image,
        name: "نام آیتم در دسته بندی",
        price: 22_000_000,
        categoryId: 1,
        description: "  توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح  توضیح توضیح"
        //onClick: () => {},
    },
    {
        id: 5,
        image: image,
        name: "نام آیتم در دسته بندی",
        price: 22_000_000,
        categoryId: 1,
        description: "  توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح  توضیح توضیح"
        //onClick: () => {},
    },
    {
        id: 6,
        image: image,
        name: "نام آیتم در دسته بندی",
        price: 22_000_000,
        categoryId: 1,
        description: "  توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح  توضیح توضیح"
        //onClick: () => {},
    },
    {
        id: 7,
        image: image,
        name: "نام آیتم در دسته بندی",
        price: 22_000_000,
        categoryId: 1,
        description: "  توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح  توضیح توضیح"
        //onClick: () => {},
    },
    {
        id: 8,
        image: image,
        name: "نام آیتم در دسته بندی",
        price: 22_000_000,
        categoryId: 1,
        description: "  توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح  توضیح توضیح"
        //onClick: () => {},
    },
    {
        id: 9,
        image: image,
        name: "نام آیتم در دسته بندی",
        price: 22_000_000,
        categoryId: 1,
        description: "  توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح  توضیح توضیح",
        //onClick: () => {},
    },
    {
        id: 10,
        image: image,
        name: "نام آیتم در دسته بندی",
        price: 22_000_000,
        categoryId: 1,
        description: "  توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح توضیح  توضیح توضیح"
        //onClick: () => {},,
    },
];